{
  "appname": "Football kit collections",
  "defFootballers": [
    {
      "id": 1,
      "fullName": "Lionel Messi",
      "name": "Messi",
      "age": 31,
      "alive": true,
      "active": true,
      "team": "FC Barcelona",
      "national_team": "Argentinia",
      "bio": "Messi is an Argentine professional footballer who plays as a forward and captains both Spanish club Barcelona and the Argentina national team. Often considered the best player in the world and regarded by many as the greatest player of all time, Messi has won a record-tying five Ballon d'Or awards, four of which he won consecutively, and a record five European Golden Shoes."
    },
    {
      "id": 2,
      "fullName": "Cristiano Ronaldo",
      "name": "Ronaldo",
      "age": 34,
      "alive": true,
      "active": true,
      "team": "Juventus",
      "national_team": "Portugal",
      "bio": "Ronaldo is a Portuguese professional footballer who plays as a forward for Italian club Juventus and captains the Portugal national team. Often considered the best player in the world and regarded by many as one of the greatest players of all time, Ronaldo has a record-tying five Ballon d'Or awards, the most for a European player, and is the first player to win four European Golden Shoes."
    },
    {
      "id": 3,
      "fullName": "Johan Cruyff",
      "name": "Cruyff",
      "age": 69,
      "alive": false,
      "active": false,
      "team": "none",
      "biggest_period": ["FC Barcelona", "Ajax"],
      "national_team": "The Netherlands",
      "bio": "Johannes (Johan) Cruyff was a Dutch professional football player and coach. As a player, he won the Ballon d'Or three times, in 1971, 1973, and 1974. Cruyff was the most famous exponent of the football philosophy known as Total Football explored by Rinus Michels, and is widely regarded as one of the greatest players in football history."
    },
    {
      "id": 4,
      "fullName": "Neymar Jr.",
      "name": "Neymar",
      "age": 27,
      "alive": true,
      "active": true,
      "team": "PSG",
      "national_team": "Brasil",
      "bio": "Neymar is a Brazilian professional footballer who plays as a forward for French club Paris Saint-Germain and the Brazil national team. Considered one of the best players in the world, he is known for his dribbling, finishing, skill, pace, and ability to play with both feet."
    },
    {
      "id": 5,
      "fullName": "Diego Maradona",
      "name": "Maradona",
      "age": 58,
      "alive": true,
      "active": false,
      "team": "none",
      "biggest_period": ["Napoli"],
      "national_team": "Argentina",
      "bio": "Diego Armando Maradona is an Argentine retired professional footballer and current manager of Mexican second division club Dorados. Many in the sport, including football writers, players, and fans, regard him as the greatest football player of all time. He was joint FIFA Player of the 20th Century with Pelé."
    },
    {
      "id": 6,
      "fullName": "David De Gea",
      "name": "Degea",
      "age": 28,
      "alive": true,
      "active": true,
      "team": "Manchester United",
      "national_team": "Spain",
      "bio": "is a Spanish professional footballer who plays as a goalkeeper for Premier League club Manchester United and the Spain national team. He is considered the best goalkeeper ever on this planet because of his unhuman reflexes and positioning in goal."
    },
    {
      "id": 7,
      "fullName": "Eusebio",
      "name": "Eusebio",
      "age": 72,
      "alive": false,
      "active": false,
      "biggest_period": ["SL Benfica"],
      "national_team": "Portugal",
      "bio": "Eusebio was a Portuguese footballer who played as a striker. Eusébio is considered by many as one of the greatest footballers of all time. During his professional career, he scored 733 goals in 745 matches"
    },
    {
      "id": 8,
      "fullName": "Pele",
      "name": "Pele",
      "age": 78,
      "alive": false,
      "active": false,
      "biggest_period": ["Santos"],
      "national_team": "Brasil",
      "bio": "Peke is a Brazilian retired professional footballer who played as a forward. He is regarded by many in the sport, including football writers, players, and fans, as the greatest player of all time. In 1999, he was voted World Player of the Century by the International Federation of Football History & Statistics (IFFHS), and was one of the two joint winners of the FIFA Player of the Century award. That same year, Pelé was elected Athlete of the Century by the International Olympic Committee. According to the IFFHS, Pelé is the most successful domestic league goal-scorer in football history scoring 650 goals in 694 League matches, and in total 1281 goals in 1363 games, which included unofficial friendlies and is a Guinness World Record. During his playing days, Pelé was for a period the best-paid athlete in the world."
    },
    {
      "id": 9,
      "fullName": "Beckenbauer",
      "name": "Beckenbauer",
      "age": 73,
      "alive": true,
      "active": false,
      "biggest_period": ["Bayern Munich"],
      "national_team": "Germany",
      "bio": "Beckenbauer is a German former professional footballer and manager. Early in his playing career he was nicknamed Der Kaiser (The Emperor) because of his elegant style, dominance and leadership on the field, and also as his first name Franz is reminiscent of the Austrian emperors. He is widely regarded to be one of the greatest players in the history of the sport. A versatile player who started out as a midfielder, Beckenbauer made his name as a central defender. He is often credited as having invented the role of the modern sweeper or libero."
    },
    {
      "id": 10,
      "fullName": "Eden Hazard",
      "name": "Hazard",
      "age": 28,
      "alive": true,
      "active": true,
      "team": "Chelsea",
      "national_team": "Belgium",
      "bio": "Hazard is a Belgian professional footballer who plays for English club Chelsea and captains the Belgium national team. Primarily playing as an attacking midfielder and as a wide midfielder, Hazard is known for his creativity, speed, dribbling and excellent passing. He has earned critical acclaim for his playing style, with the media, coaches, and players drawing comparisons to Ballon d'Or winners Lionel Messi and Cristiano Ronaldo, and Hazard is widely considered one of the best players in the world."
    },
    {
      "id": 11,
      "fullName": "Paulo Maldini",
      "name": "Maldini",
      "age": 50,
      "alive": true,
      "active": false,
      "biggest_period": ["AC Milan"],
      "national_team": "Italy",
      "bio": "is an Italian former professional footballer who played as a left back and central defender for A.C. Milan and the Italy national team, who is widely regarded as the greatest defender ever, and as one of the greatest players of all time. He spent all 25 seasons of his career in the Serie A with Milan, before retiring at the age of 41 in 2009. He won 26 trophies with Milan: the UEFA Champions League five times, seven Serie A titles, one Coppa Italia, five Supercoppa Italiana titles, five European Super Cups, two Intercontinental Cups and one FIFA Club World Cup. Paolo Maldini is currently the co-owner of North American Soccer League (NASL) club Miami FC. He is also serving as sporting strategy & development director for Milan."
    },
    {
      "id": 12,
      "fullName": "Gianluigi Buffon",
      "name": "Buffon",
      "age": 41,
      "alive": true,
      "active": true,
      "team": "PSG",
      "national_team": "Italy",
      "bio": "is an Italian professional footballer who plays as a goalkeeper for French club Paris Saint-Germain. He is widely regarded by players, pundits and managers as one of the greatest goalkeepers of all time, and, by some, as the greatest ever."
    },
    {
      "id": 13,
      "fullName": "Javier Zanetti",
      "name": "Zanetti",
      "age": 45,
      "alive": true,
      "active": false,
      "biggest_period": ["Inter Milan"],
      "national_team": "Argentina",
      "bio": "With 1,114 official games played, he is seventh on the list of players in history with the most career appearances. He is also the foreign player with the most appearances in Serie A (615), and holds the fourth-most appearances in the league, behind only Paolo Maldini, Gianluigi Buffon and Francesco Totti. He is the most capped player in the history of Inter (858), and won 16 trophies with the club: five Scudetti, four Coppa Italia, four Supercoppa Italiana, one UEFA Cup, one Champions League and the FIFA Club World Cup. He is also the most capped player as captain in the Champions League (82)."
    }
  ],
  "myCollection": [
    {
      "id": 1,
      "playerName": "Ronaldinho",
      "name": "Ronaldinho",
      "year": 2004,
      "team": "Barcelona",
      "signed": true,
      "matchworn": false,
      "description": "Won this wonderfull piece of history on a bidding website. So Stunned with this shirt of one of the best players ever on this planet!",
      "brand": "Nike"
  },
    {
        "id": 2,
        "playerName": "Paul Pogba",
        "year": 2016,
        "name": "pogba",
        "team": "Juventus",
        "signed": true,
        "matchworn": true,
        "description": "UCL Final VS Barcelona",
        "brand": "Adidas"
    }
    ,
    {
        "id": 3,
        "playerName": "Jose Izquierdo",
        "name": "Izquierdo",
        "year": 2016,
        "team": "Club Brugge",
        "signed": true,
        "matchworn": false,
        "description": "Christmas Present",
        "brand": "Nike"
    }
  ]
}
